/**
 * 例外処理の記述
 * アルゴリズムに従って、処理しないものは、以下に変換情報を記述しておく。
 * 
 * @type {{"MJ文字図形名": string, "変換情報": {"JIS X 0213": string, "UCS": string}}[]}
 */
exports.例外情報 = [
	{"MJ文字図形名":"MJ006457", "変換情報":{"JIS X 0213":"1-30-71", "UCS": "U+4E1E"}}, 
	{"MJ文字図形名":"MJ011815", "変換情報":{"JIS X 0213":"1-56-38", "UCS": "U+613C"}}, 
	{"MJ文字図形名":"MJ016886", "変換情報":{"JIS X 0213":"1-45-07", "UCS": "U+53CB"}}, 
	{"MJ文字図形名":"MJ020479", "変換情報":{"JIS X 0213":"1-37-27", "UCS": "U+7E8F"}}, 
	{"MJ文字図形名":"MJ057404", "変換情報":{"JIS X 0213":"1-33-67", "UCS": "U+5DE3"}}, 
	
	{"MJ文字図形名":"MJ019374", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ034976", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ035231", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ038675", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ056889", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ057204", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ057262", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ057625", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 
	{"MJ文字図形名":"MJ057639", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}}, 

	// * 2015-08-17 追加
	// * MJ004411, MJ014719, MJ038446, MJ039434 別字リンクが含まれているもの。
	// * MJ016011は、1-43-94は別字が含まれる経路なので、1-44-01を選択
	{"MJ文字図形名":"MJ016011", "変換情報":{"JIS X 0213":"1-44-01", "UCS": "U+6F2B"}},
	{"MJ文字図形名":"MJ004411", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}},
	{"MJ文字図形名":"MJ014719", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}},
	{"MJ文字図形名":"MJ038446", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}},
	{"MJ文字図形名":"MJ039434", "変換情報":{"JIS X 0213":"1-01-18", "UCS": "U+FF3F"}},
];
